# ☝️ CRUD: Create => Read => Update => Delete

このノートブックではレコードを追加・更新・削除する方法について確認していきます。

> CRUD（クラッド）とは、ほとんど全てのコンピュータソフトウェアが持つ永続性[1]の4つの基本機能のイニシャルを並べた用語。その4つとは、Create（生成）、Read（読み取り）、Update（更新）、Delete（削除）である。ユーザインタフェースが備えるべき機能（情報の参照/検索/更新）を指す用語としても使われる。
>
> https://ja.wikipedia.org/wiki/CRUD

## 1. 初期設定

Jupyter Notebook を再起動した場合などはここから実行してください

In [ ]:
! pip install ipython-sql pymysql
%load_ext sql

## 2. 接続確認

In [2]:
%%sql mysql+pymysql://hello:world@10.0.1.100/employees
select 'hello' as world

1 rows affected.

[('hello',)]

## 3. 一時テーブルの作成

この演習で使用している `hello` ユーザーには `employees` データベースの読み取り権限のほか一時的なテーブルを作成することができる `tmp` データベースへのアクセス権限を付与してあります。このノートブックでは `tmp` データベースを使って、データを格納・更新・削除するための方法を確認していきます。

以下のクエリを実行することで一時的なテーブルを作成することができます。`<データベース名>.<テーブル名>` のようにテーブル名を指定することで別のデータベースにあるテーブルを指定できます。

In [3]:
%%sql
create temporary table tmp.hello (
    id int,
    value text
)

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.

[]

## 4. レコードの追加

INSERT 文を利用することでテーブルにレコードを追加することができます。

In [4]:
%%sql
insert into tmp.hello values (10, "item-1"), (20, "item-2");

select * from tmp.hello;

 * mysql+pymysql://hello:***@10.0.1.100/employees
2 rows affected.
2 rows affected.

[(10, 'item-1'), (20, 'item-2')]

## 5. クエリの実行結果を元にテーブルを作成する

多くのクエリエンジンにはテーブルを作成する際に SELECT 文の実行結果をそのまま格納できる `CREATE TABLE AS` (CTAS) という構文が用意されています。集計に時間がかかるようなクエリの実行結果を保存したり、異なるサーバーにあるデータベースにあるテーブルをコピーするときなどに便利な機能です。以下は `employees` テーブルから `emp_no` が `10005` 未満の社員情報を `tmp.new_employees` テーブルに格納するクエリです。

In [5]:
%%sql
create temporary table tmp.new_employees as
select
    *
from
    employees
where
    emp_no  < 10005
;

select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
4 rows affected.
4 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1))]

`INSERT` 文についても `SELECT` 文の実行結果をそのまま挿入することができます。以下は先ほど作ったテーブルに `employees` から `emp_no` が `499997` 以上のレコードを追加するクエリです。

In [6]:
%%sql
insert into tmp.new_employees
select * from employees where emp_no >= 499997;

select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.
7 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (499997, datetime.date(1961, 8, 3), 'Berhard', 'Lenart', 'M', datetime.date(1986, 4, 21)),
 (499998, datetime.date(1956, 9, 5), 'Patricia', 'Breugel', 'M', datetime.date(1993, 10, 13)),
 (499999, datetime.date(1958, 5, 1), 'Sachin', 'Tsukuda', 'M', datetime.date(1997, 11, 30))]

## 6. レコードの更新

`UPDATE` 文を利用することでレコードを更新することができます。

```sql
UPDATE
    <テーブル名>
SET
    <カラム名> = <新しい値>
WHERE
    <検索条件>
```

以下のクエリは `tmp.new_employees` テーブルについて `emp_no` が `10003` である社員の `first_name` を `Raryosu` に変更します。

In [7]:
%%sql
update tmp.new_employees set first_name = 'Raryosu' where emp_no = 10003;

select * from tmp.new_employees where emp_no = 10003;

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.
1 rows affected.

[(10003, datetime.date(1959, 12, 3), 'Raryosu', 'Bamford', 'M', datetime.date(1986, 8, 28))]

## 7. レコードの削除

DELETE 文を利用することでレコードを削除することができます。

```sql
DELETE FROM
    <テーブル名>
WHERE
    <検索条件>
```

以下のクエリは `tmp.new_employees` テーブルについて `first_name` が `Raryosu` であるレコードを削除します。

In [8]:
%%sql
delete from tmp.new_employees where first_name = 'Raryosu'

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[]

`emp_no` が `10003` のレコードが削除されました。

In [12]:
%%sql
select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
6 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (499997, datetime.date(1961, 8, 3), 'Berhard', 'Lenart', 'M', datetime.date(1986, 4, 21)),
 (499998, datetime.date(1956, 9, 5), 'Patricia', 'Breugel', 'M', datetime.date(1993, 10, 13)),
 (499999, datetime.date(1958, 5, 1), 'Sachin', 'Tsukuda', 'M', datetime.date(1997, 11, 30))]

`DELETE` 文で検索条件を指定しない場合は全てのレコードが削除されます。

In [13]:
%%sql
delete from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
6 rows affected.

[]

In [14]:
%%sql
select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.

[]

`TRUNCATE` 文を使うことでも全てのレコードを削除することができます。

In [17]:
%%sql
truncate tmp.hello;

select * from tmp.hello;

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.
0 rows affected.

[]

それぞれの以下のような特徴があります。

- `DELETE` 文
    - トランザクションでロールバックできる
- `TRUNCATE` 文
    - ロールバックできないが高速（テーブルを再構築する）

## 8. テーブルの削除

`DROP TABLE` 文を実行することでテーブルを削除できます。以下は `tmp.new_employees` テーブルを削除するクエリです。

In [19]:
%%sql
drop table tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.

[]

## 🌱 練習問題

`concat` 関数を利用することで文字列を結合することができます。

In [40]:
%%sql
select
    concat('Hello', ', ', 'World') as col

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[('Hello, World',)]

ここで `employees` テーブルを元に社員のフルネームが入ったテーブル `tmp.emp_full_names` を作成し `emp_no` が `219686` である社員のフルネームを検索できるようにしましょう。

- `first_name` と　`last_name` を半角スペースで区切った文字列をフルネームとするものとします
- テーブル定義については `emp_no` で検索できるようにしてください
- フルネームを表すカラムの名前は問いませんが分かりやすいものに指定してみましょう 👍

In [ ]:
%%sql
-- 2回目以降実行するときはテーブルの作成で重複エラーが出るので
-- 下の行のコメントを解除して DROP TABLE を実行するようにしてください
-- drop table tmp.emp_full_names;
create temporary table tmp.emp_full_names as

-- Hint: この下に SELECT 文を記述してください
select
    1 as emp_no
;

-- 下のクエリが通るように tmp.emp_full_names テーブルを作成してみましょう
select
    *
from
    tmp.emp_full_names
where
    emp_no = 219686

以下のコードを実行して回答（対象社員のフルネーム）を提出してください。

In [ ]:
# 実行後、"your answer" の右側に表示される入力ボックスに答えを入力し Enter キーを押してください m(_ _)m
import urllib.request

answer = input('your answer: ')

url = 'http://10.0.1.100:18080/submit'
data = 'q=q3&a={}'.format(answer.strip()).encode('utf-8')
req = urllib.request.Request(url, data=data, method='POST')
with urllib.request.urlopen(req) as res:
    print(res.read().decode('utf-8'))